app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
<header id="content-header">
  <h1><%= link_to pluralize(@reviews.size, "review"), movie_reviews_path(@movie) %> for <%= link_to(@movie.title, @movie) %></h1>